app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id]
  end
end

---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]